Repository: microsoft/azuredatastudio-postgresql
Catalog: src/l10n/transXlf/l10n.*.xlf
Languages: de, ja, pt_br, ru, zh_hans, zh_hant

# json.schemas.desc
source: Associate schemas to JSON files in the current project
de: Hiermit werden Schemas zu JSON-Dateien im aktuellen Projekt zugeordnet.
ja: スキーマを現在のプロジェクトの JSON ファイルに関連付けます
pt_br: Esquemas associados a arquivos JSON no projeto atual
ru: Связь схем с JSON-файлами в текущем проекте
zh_hans: 将架构关联到当前项目中的 JSON 文件
zh_hant: 在結構描述與目前專案的 JSON 檔案之間建立關聯

# json.schemas.url.desc
source: A URL to a schema or a relative path to a schema in the current directory
de: Eine URL zu einem Schema oder ein relativer Pfad zu einem Schema im aktuellen Verzeichnis
ja: スキーマへの URL または現在のディレクトリ内のスキーマへの相対パス
pt_br: Uma URL para um esquema ou um caminho relativo a um esquema no diretório atual
ru: URL-адрес схемы или относительный путь к ней в текущем каталоге
zh_hans: 架构的 URL 或当前目录中架构的相对路径
zh_hant: 目前目錄中的結構描述 URL 或結構描述相對路徑

# json.schemas.fileMatch.desc
source: An array of file patterns to match against when resolving JSON files to schemas.
de: Ein Array aus Dateimustern zum Abgleich beim Auflösen von JSON-Dateien in Schemas
ja: JSON ファイルをスキーマに解決するときに突き合わせるファイル パターンの配列です。
pt_br: Uma matriz de padrões de arquivos para fazer correspondência ao resolver arquivos JSON para esquemas.
ru: Массив шаблонов файлов, с которым выполняется сравнение, при разрешении JSON-файлов в схемах.
zh_hans: 将 JSON 文件解析到架构时用于匹配的一组文件模式。
zh_hant: 檔案模式陣列，在將 JSON 檔案解析成結構描述時的比對對象。

# json.schemas.fileMatch.item.desc
source: A file pattern that can contain '*' to match against when resolving JSON files to schemas.
de: Ein Dateimuster, das "*" enthalten kann, zum Abgleich beim Auflösen von JSON-Dateien in Schemas
ja: JSON ファイルをスキーマに解決するときに突き合わせる、'*' を含められるファイル パターンです。
pt_br: Um padrão de arquivos que pode conter '*' para fazer a correspondência ao resolver arquivos JSON para esquemas.
ru: Шаблон файла, который может содержать "*" и с которым выполняется сравнение, при разрешении JSON-файлов в схемах.
zh_hans: 将 JSON 文件解析到架构时用于匹配的可以包含 "*" 的文件模式。
zh_hant: 可包含 '*' 的檔案模式，在將 JSON 檔案解析成結構描述時的比對對象。

# json.schemas.schema.desc
source: The schema definition for the given URL. The schema only needs to be provided to avoid accesses to the schema URL.
de: Die Schemadefinition für die angegebene URL. Das Schema muss nur angegeben werden, um Zugriffe auf die Schema-URL zu vermeiden.
ja: 指定された URL のスキーマ定義です。スキーマは、スキーマ URL へのアクセスを避けるためにのみ指定する必要があります。
pt_br: A definição de esquema para a URL fornecida. O esquema precisa ser fornecido apenas para evitar acessos à URL do esquema.
ru: Определение схемы для указанного URL-адреса. Схему необходимо указать только для того, чтобы не обращаться по URL-адресу схемы.
zh_hans: 给定 URL 的架构定义。仅当要避免访问架构 URL 时需要提供架构。
zh_hant: 指定 URL 的結構描述定義。只須提供結構描述以避免存取結構描述 URL。

# json.format.enable.desc
source: Enable/disable default JSON formatter (requires restart)
de: Standard-JSON-Formatierer aktivieren/deaktivieren (Neustart erforderlich)
ja: 既定の JSON フォーマッタを有効/無効にします (再起動が必要です)
pt_br: Habilitar/desabilitar o formatador JSON padrão (requer reinicialização)
ru: Включение или отключение модуля форматирования JSON по умолчанию (требуется перезагрузка)
zh_hans: 启用/禁用默认 JSON 格式化程序(需要重启)
zh_hant: 啟用/停用預設 JSON 格式器 (需要重新啟動)

# postgres.description
source: PostgreSQL extension for Azure Data Studio
de: PostgreSQL-Erweiterung für Azure Data Studio
ja: Azure Data Studio 用 PostgreSQL 拡張機能
pt_br: Extensão PostgreSQL para Azure Data Studio
ru: Расширение PostgreSQL для Azure Data Studio
zh_hans: 适用于 Azure Data Studio 的 PostgreSQL 扩展
zh_hant: Azure Data Studio 的 PostgreSQL 延伸模組

# postgres.logDebugInfo.description
source: [Optional] Log debug output to the VS Code console (Help -> Toggle Developer Tools)
de: [Optional] Protokollieren Sie die Debugausgabe in der VS Code-Konsole (Hilfe > Entwicklertools umschalten).
ja: [省略可能] デバッグ出力を VS Code コンソールにログとして表示する (ヘルプ -> 開発者ツールの切り替え)
pt_br: [Opcional] Registre a saída de depuração no console do VS Code (Ajuda -> Alternar Ferramentas para Desenvolvedores)
ru: [Необязательно] Выводить выходные данные отладки в консоль VS Code (Справка -> Переключить средства разработчика)
zh_hans: [可选] 将调试输出记录到 VS Code 控制台(“帮助”->“切换开发人员工具”)
zh_hant: [Optional] 在 VS Code 主控台中記錄偵錯輸出 (說明 -> 切換開發人員工具)

# postgres.configuration.title
source: PostgreSQL configuration
de: PostgreSQL-Konfiguration
ja: PostgreSQL の構成
pt_br: Configuração do PostgreSQL
ru: Конфигурация PostgreSQL
zh_hans: PostgreSQL 配置
zh_hant: PostgreSQL 設定

# postgres.enabled.description
source: [Optional] Enable PostgreSQL support (currently in development)
de: [Optional] Aktivieren Sie die PostgreSQL-Unterstützung (derzeit in der Entwicklung).
ja: [省略可能] PostgreSQL サポートを有効にする (現在開発中)
pt_br: [Opcional] Habilite o suporte PostgreSQL (atualmente em desenvolvimento)
ru: [Необязательно] Включить поддержку PostgreSQL (сейчас в разработке)
zh_hans: [可选] 启用 PostgreSQL 支持(当前正在开发中)
zh_hant: [選擇性] 啟用 PostgreSQL 支援 (目前正在開發中)

# postgres.debugSourcePath.description
source: [Optional] Path to the source directory of the PG SQL Tools Service, for debugging
de: [Optional] Pfad zum Quellverzeichnis des PG SQL-Toolsdiensts zum Debuggen
ja: [省略可能]デバッグ用の PG SQL Tools サービスのソース ディレクトリへのパス
pt_br: [Opcional] Caminho para o diretório de origem do PG SQL Tools Service, para depuração
ru: [Необязательно] Путь к исходному каталогу службы PG SQL Tools для отладки.
zh_hans: [可选] PG SQL 工具服务源目录的路径，用于调试
zh_hant: [選擇性] PG SQL 工具服務的來源目錄路徑，用於進行偵錯

# postgres.useDebugSource.description
source: [Optional] Enable running the PostgreSQL extension via the path set in pgsql.debugSourcePath
de: [Optional] Aktivieren Sie die Ausführung der MySQL-Erweiterung über den in „pgsql.debugSourcePath“ festgelegten Pfad.
ja: [省略可能] pgsql.debugSourcePath で設定されたパスを使用して PostgreSQL 拡張機能の実行を有効にする
pt_br: [Opcional] Habilite a execução da extensão PostgreSQL por meio do caminho definido em pgsql.debugSourcePath
ru: [Необязательно] Включите запуск расширения PostgreSQL по пути, указанному в pgsql.debugSourcePath.
zh_hans: [可选] 通过在 pgsql.debugSourcePath 中设置的路径支持运行 PostgreSQL 扩展
zh_hant: [選擇性] 透過 pgsql.debugSourcePath 中設定的路徑，啟用 PostgreSQL 延伸模組的執行

# postgres.enableStartupDebugging.description
source: [Optional] Whether to make the PG SQL Tools Service wait for a debugger to attach when starting
de: [Optional] Gibt an, ob der PG SQL-Toolsdienst beim Starten auf das Anfügen eines Debuggers warten soll
ja: [省略可能] 起動時にデバッガーがアタッチされるのを PG SQL Tools サービスに待機させるかどうか
pt_br: [Opcional] Se deve fazer o PG SQL Tools Service aguardar a conexão de um depurador ao iniciar
ru: [Необязательно] Следует ли заставлять службу PG SQL Tools ждать подключения отладчика при запуске.
zh_hans: [可选] 是否将 PG SQL 工具服务设置为在启动时等待调试器附加
zh_hant: [選擇性] 是否要讓 PG SQL 工具服務在啟動時等候偵錯工具連結

# postgres.debugServerPort.description
source: [Optional] The port to run the PG SQL Tools Service remote debugger on (default 3000)
de: [Optional] Der Port, an dem der Remotedebugger des PG SQL-Toolsdiensts ausgeführt werden soll (Standard: 3000)
ja: [省略可能] PG SQL Tools Service リモート デバッガーを実行するポート (既定値は 3000)
pt_br: [Opcional] A porta para executar o depurador remoto do PG SQL Tools Service (padrão 3000)
ru: [Необязательно] Порт для запуска удаленного отладчика службы PG SQL Tools Service (по умолчанию 3000).
zh_hans: [可选] 要运行 PG SQL 工具服务远程调试器的端口(默认值为 3000)
zh_hant: [選擇性] 要在其上執行 PG SQL 工具服務遠端偵錯程式的連接埠 (預設為 3000)

# postgres.defaultDatabase.description
source: The default database to use when creating a new PostgreSQL connection
de: Die Standarddatenbank, die beim Erstellen einer neuen PostgreSQL-Verbindung verwendet werden soll
ja: 新しい PostgreSQL 接続を作成するときに使用する既定のデータベース
pt_br: O banco de dados padrão a ser usado ao criar uma nova conexão PostgreSQL
ru: База данных по умолчанию, используемая при создании нового соединения PostgreSQL.
zh_hans: 创建新的 PostgreSQL 连接时要使用的默认数据库
zh_hant: 建立新的 PostgreSQL 連線時要使用的預設資料庫

# postgres.format.keywordCase.description
source: [Optional] Changes how keywords are formatted. Allowed values are 'upper', 'lower' and 'capitalize'.
de: [Optional] Ändert, wie Schlüsselwörter formatiert werden. Zulässige Werte sind „upper“, „lower“ und „capitalize“.
ja: [省略可能] キーワードの書式を変更します。使用できる値は 'upper'、'lower'、'capitalize' です。
pt_br: [Opcional] Altera a forma como as palavras-chave são formatadas. Os valores permitidos são 'superior', 'inferior' e 'maiúsculo'.
ru: [Необязательно] Изменяет формат ключевых слов. Допустимые значения: "upper", "lower" и "capitalize".
zh_hans: [可选] 更改关键字的格式设置方式。允许的值为“大写”、“小写”和“首字母大写”。
zh_hant: [選擇性] 變更關鍵字的格式。允許的值為 'upper', 'lower' 和 'capitalize'。

# postgres.format.identifierCase.description
source: [Optional] Changes how identifiers are formatted. Allowed values are 'upper', 'lower' and 'capitalize'.
de: [Optional] Ändert, wie Bezeichner formatiert werden. Zulässige Werte sind „upper“, „lower“ und „capitalize“.
ja: [省略可能] 識別子の書式を変更します。使用できる値は 'upper'、'lower'、'capitalize' です。
pt_br: [Opcional] Altera como os identificadores são formatados. Os valores permitidos são 'superior', 'inferior' e 'maiúsculo'.
ru: [Необязательно] Изменяет формат идентификаторов. Допустимые значения: "upper", "lower" и "capitalize".
zh_hans: [可选] 更改标识符的格式设置方式。允许的值为“大写”、“小写”和“首字母大写”。
zh_hant: [選擇性] 變更識別碼的格式。允許的值為 'upper', 'lower' 和 'capitalize'。

# postgres.format.stripComments.description
source: [Optional] If true comments are removed from the statements
de: [Optional] Bei „wahr“ werden Kommentare aus den Anweisungen entfernt.
ja: [省略可能] true の場合、コメントがステートメントから削除されます
pt_br: [Opcional] Se os comentários verdadeiros forem removidos das declarações
ru: [Необязательно] Если задано значение "true", комментарии будут удалены из инструкций
zh_hans: [可选] 如果为 true，则从语句中移除注释
zh_hant: [選擇性] 如果為 True，則會從陳述式中移除註解

# postgres.format.reindent.description
source: [Optional] If true the indentations of the statements are changed.
de: [Optional] Bei „wahr“ werden die Einzüge der Anweisungen geändert.
ja: [省略可能] true の場合、ステートメントのインデントが変更されます。
pt_br: [Opcional] Se verdadeiro, os recuos das instruções são alterados.
ru: [Необязательно] Если задано значение "true", отступы инструкций будут изменены.
zh_hans: [可选] 如果为 true，则更改语句的缩进。
zh_hant: [選擇性] 如果為 True，則會變更陳述式的縮排。

# postgres.connectionOptions.groupName.source
source: Source
de: Quelle
ja: ソース
pt_br: Fonte
ru: Источник
zh_hans: 源
zh_hant: 來源

# postgres.connectionOptions.groupName.security
source: Security
de: Sicherheit
ja: セキュリティ
pt_br: Segurança
ru: Безопасность
zh_hans: 安全性
zh_hant: 安全性

# postgres.connectionOptions.groupName.server
source: Server
ja: サーバー
pt_br: Servidor
ru: Сервер
zh_hans: 服务器
zh_hant: 伺服器

# postgres.connectionOptions.groupName.client
source: Client
ja: クライアント
pt_br: Cliente
ru: Клиент
zh_hans: 客户端
zh_hant: 用戶端

# postgres.connectionOptions.connectionName.displayName
source: Name (optional)
ja: 名前 (省略可能)
pt_br: Nome (opcional)
ru: Имя (необязательно)
zh_hans: 名称(可选)
zh_hant: 名稱 (選用)

# postgres.connectionOptions.connectionName.description
source: Custom name of the connection
de: Benutzerdefinierter Name der Verbindung
ja: 接続のカスタム名
pt_br: Nome personalizado da conexão
ru: Настраиваемое имя подключения
zh_hans: 连接的自定义名称
zh_hant: 連線的自訂名稱

# postgres.connectionOptions.host.displayName
source: Server name
ja: サーバー名
pt_br: Nome do servidor
ru: Имя сервера
zh_hans: 服务器名称
zh_hant: 伺服器名稱

# postgres.connectionOptions.host.description
source: Name of the PostgreSQL instance
de: Name der PostgreSQL-Instanz
ja: PostgreSQL インスタンスの名前
pt_br: Nome da instância do PostgreSQL
ru: Имя экземпляра PostgreSQL
zh_hans: PostgreSQL 实例的名称
zh_hant: PostgreSQL 執行個體的名稱

# postgres.connectionOptions.authenticationType.displayName
source: Authentication type
de: Authentifizierungstyp
ja: 認証の種類
pt_br: Tipo de autenticação
ru: Тип проверки подлинности
zh_hans: 身份验证类型
zh_hant: 驗證類型

# postgres.connectionOptions.authenticationType.description
source: How to authenticate with server
de: So authentifizieren Sie sich beim Server
ja: サーバーの認証方法
pt_br: Como autenticar com o servidor
ru: Не удалось пройти проверку подлинности на сервере
zh_hans: 如何向服务器进行身份验证。
zh_hant: 如何向伺服器驗證

# postgres.connectionOptions.authenticationType.password
source: Password
de: Kennwort
ja: パスワード
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# postgres.connectionOptions.dbname.displayName
source: Database name
de: Datenbankname
ja: データベース名
pt_br: Nome do banco de dados
ru: Имя базы данных
zh_hans: 数据库名称
zh_hant: 資料庫名稱

# postgres.connectionOptions.dbname.description
source: The name of the initial catalog or database in the data source
de: Der Name des Anfangskatalogs oder der Anfangsdatenbank in der Datenquelle
ja: データ ソース内の初期カタログまたはデータベースの名前
pt_br: O nome do catálogo ou banco de dados inicial na fonte de dados
ru: Имя исходного каталога или базы данных в источнике данных
zh_hans: 数据源中的初始目录或数据库的名称。
zh_hant: 資料來源中初始目錄或資料庫的名稱。

# postgres.connectionOptions.user.displayName
source: User name
de: Benutzername
ja: ユーザー名
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# postgres.connectionOptions.user.description
source: Indicates the user ID to be used when connecting to the data source
de: Gibt die Benutzer-ID an, die beim Herstellen einer Verbindung mit der Datenquelle verwendet werden soll.
ja: データ ソースへの接続時に使用するユーザー ID を示します
pt_br: Indica a ID de usuário a ser usada ao conectar-se à fonte de dados
ru: Указывает идентификатор пользователя, который необходимо использовать для подключения к источнику данных
zh_hans: 指示连接到数据源时使用的用户 ID
zh_hant: 代表要在連線至資料來源時使用的使用者識別碼

# postgres.connectionOptions.password.displayName
source: Password
de: Kennwort
ja: パスワード
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# postgres.connectionOptions.password.description
source: Indicates the password to be used when connecting to the data source
de: Gibt das Kennwort an, das beim Herstellen einer Verbindung mit der Datenquelle verwendet werden soll.
ja: データ ソースへの接続時に使用するパスワードを示します
pt_br: Indica a senha a ser usada ao conectar-se à fonte de dados
ru: Указывает пароль, который необходимо использовать для подключения к источнику данных
zh_hans: 指示连接到数据源时使用的密码
zh_hant: 代表要在連線至資料來源時使用的密碼

# postgres.connectionOptions.hostIp.displayName
source: Host IP address
de: Host-IP-Adresse
ja: ホスト IP アドレス
pt_br: Endereço IP do Host
ru: IP-адрес узла
zh_hans: 主机 IP 地址
zh_hant: 主機 IP 位址

# postgres.connectionOptions.hostIp.description
source: IP address of the server
de: IP-Adresse des Servers
ja: サーバーの IP アドレス
pt_br: Endereço IP do servidor
ru: IP-адрес сервера
zh_hans: 服务器的 IP 地址
zh_hant: 伺服器的 IP 位址

# postgres.connectionOptions.port.displayName
source: Port
ja: ポート
pt_br: Porta
ru: Порт
zh_hans: 端口
zh_hant: 連接埠

# postgres.connectionOptions.port.description
source: Port number for the server
de: Portnummer für den Server
ja: サーバーのポート番号
pt_br: Número da porta para o servidor
ru: Номер порта для сервера
zh_hans: 服务器端口号
zh_hant: 伺服器的連接埠號碼

# postgres.connectionOptions.connectTimeout.displayName
source: Connect timeout
de: Verbindungstimeout
ja: 接続タイムアウト
pt_br: Tempo limite de conexão
ru: Время ожидания подключения
zh_hans: 连接超时
zh_hant: 連線逾時

# postgres.connectionOptions.connectTimeout.description
source: Seconds to wait before timing out when connecting
de: Sekunden, die gewartet werden müssen, bevor beim Herstellen der Verbindung ein Timeout auftritt
ja: 接続時にタイムアウトするまでの待機時間 (秒)
pt_br: Segundos para esperar antes de expirar ao conectar
ru: Число секунд до истечения времени ожидания при подключении
zh_hans: 连接时超时之前要等待的秒数
zh_hant: 連線逾時前要等待的秒數

# postgres.connectionOptions.clientEncoding.displayName
source: Client encoding
de: Clientcodierung
ja: クライアント エンコード
pt_br: Codificação do cliente
ru: Кодирование клиента
zh_hans: 客户端编码
zh_hant: 用戶端編碼

# postgres.connectionOptions.clientEncoding.description
source: The client encoding for the connection
de: Die Clientcodierung für die Verbindung
ja: 接続のクライアント エンコード
pt_br: A codificação do cliente para a conexão
ru: Кодирование клиента для соединения
zh_hans: 用于连接的客户端编码
zh_hant: 連線的用戶端編碼

# postgres.connectionOptions.options.displayName
source: Command-line options
de: Befehlszeilenoptionen
ja: コマンド ライン オプション
pt_br: Opções da linha de comando
ru: Параметры командной строки
zh_hans: 命令行选项
zh_hant: 命令列選項

# postgres.connectionOptions.options.description
source: Command-line options to send to the server when the connection starts
de: Befehlszeilenoptionen, die beim Starten der Verbindung an den Server gesendet werden sollen
ja: 接続の開始時にサーバーに送信するコマンド ライン オプション
pt_br: Opções de linha de comando para enviar ao servidor quando a conexão for iniciada
ru: Параметры командной строки для отправки на сервер при запуске соединения
zh_hans: 连接启动时发送到服务器的命令行选项
zh_hant: 連線啟動時要傳送到伺服器的命令列選項

# postgres.connectionOptions.applicationName.displayName
source: Application name
de: Anwendungsname
ja: アプリケーション名
pt_br: Nome do aplicativo
ru: Имя приложения
zh_hans: 应用程序名称
zh_hant: 應用程式名稱

# postgres.connectionOptions.applicationName.description
source: Value for the 'application_name' configuration parameter
de: Wert für den Konfigurationsparameter "application_name"
ja: 'application_name' 構成パラメーターの値
pt_br: Valor para o parâmetro de configuração 'application_name'
ru: Значение параметра конфигурации application_name
zh_hans: "application_name" 配置参数的值
zh_hant: 'application_name' 設定參數的值

# postgres.connectionOptions.ssl.displayName
source: SSL mode
de: SSL-Modus
ja: SSL モード
pt_br: Modo SSL
ru: Режим SSL
zh_hans: SSL 模式
zh_hant: SSL 模式

# postgres.connectionOptions.ssl.description
source: The SSL mode to use when connecting
de: Der SSL-Modus, der beim Herstellen einer Verbindung verwendet werden soll
ja: 接続時に使用する SSL モード
pt_br: O modo SSL a ser usado ao conectar
ru: Режим SSL, используемый при подключении
zh_hans: 连接时要使用的 SSL 模式
zh_hant: 連線時要使用的 SSL 模式

# postgres.connectionOptions.ssl.mode.disable
source: Disable
de: Deaktivieren
ja: 無効にする
pt_br: Desabilitar
ru: Отключить
zh_hant: 停用

# postgres.connectionOptions.ssl.mode.require
source: Require
de: Anfordern
ja: 必須
pt_br: Exigir
ru: Обязательно
zh_hant: 必要

# postgres.connectionOptions.ssl.mode.allow
source: Allow
de: Zulassen
ja: 許可
pt_br: Permitir
ru: Разрешить
zh_hant: 允許

# postgres.connectionOptions.ssl.mode.prefer
source: Prefer
de: Bevorzugen
ja: 優先する
pt_br: Preferir
ru: Предпочитать
zh_hant: 建議使用

# postgres.connectionOptions.ssl.mode.verify_ca
source: Verify-CA
pt_br: Verificar-CA

# postgres.connectionOptions.ssl.mode.verify_full
source: Verify-Full
ja: 完全検証
pt_br: Verificar-Completo

# postgres.connectionOptions.ssl.compression.displayName
source: Use SSL compression
de: SSL-Komprimierung verwenden
ja: SSL 圧縮を使用する
pt_br: Usar compactação SSL
ru: Использовать сжатие SSL
zh_hans: 使用 SSL 压缩
zh_hant: 使用 SSL 壓縮

# postgres.connectionOptions.ssl.compression.description
source: Whether to compress SSL connections
de: Gibt an, ob SSL-Verbindungen komprimiert werden sollen.
ja: SSL 接続を圧縮するかどうか
pt_br: Se deve compactar conexões SSL
ru: Сжимать ли SSL-соединения
zh_hans: 是否压缩 SSL 连接
zh_hant: 是否要壓縮 SSL 連線

# postgres.connectionOptions.ssl.rootcert.displayName
source: SSL root certificate filename
de: Dateiname des SSL-Stammzertifikats
ja: SSL ルート証明書のファイル名
pt_br: Nome do arquivo do certificado raiz SSL
ru: Имя файла корневого сертификата SSL
zh_hans: SSL 根证书文件名
zh_hant: SSL 根憑證檔案名稱

# postgres.connectionOptions.ssl.rootcert.description
source: The filename of the SSL root CA certificate to use
de: Der Dateiname des zu verwendenden SSL-Stammzertifizierungsstellenzertifikats.
ja: 使用する SSL ルート CA 証明書のファイル名
pt_br: O nome do arquivo do certificado CA raiz SSL a ser usado
ru: Имя файла корневого сертификата CA SSL для использования
zh_hans: 要使用的 SSL 根 CA 证书的文件名
zh_hant: 要使用的 SSL 憑證檔案名稱

# postgres.connectionOptions.ssl.key.displayName
source: SSL key filename
de: Dateiname des SSL-Schlüssels
ja: SSL キーのファイル名
pt_br: Nome do arquivo da chave SSL
ru: Имя файла ключа SSL
zh_hans: SSL 密钥文件名
zh_hant: SSL 金鑰檔案名稱

# postgres.connectionOptions.ssl.key.description
source: The filename of the key to use for the SSL certificate
de: Der Dateiname des Schlüssels, der für das SSL-Zertifikat verwendet werden soll.
ja: SSL 証明書に使用するキーのファイル名
pt_br: O nome do arquivo da chave a ser usada para o certificado SSL
ru: Имя файла ключа, который будет использоваться для сертификата SSL.
zh_hans: 用于 SSL 证书的密钥的文件名
zh_hant: 要用於 SSL 憑證之金鑰的檔案名

# postgres.connectionOptions.ssl.cert.displayName
source: SSL certificate filename
de: Dateiname des SSL-Zertifikats
ja: SSL 証明書のファイル名
pt_br: Nome do arquivo do certificado SSL
ru: Имя файла сертификата SSL
zh_hans: SSL 证书文件名
zh_hant: SSL 憑證檔案名稱

# postgres.connectionOptions.ssl.cert.description
source: The filename of the SSL certificate to use
de: Der Dateiname des zu verwendenden SSL-Zertifikats.
ja: 使用する SSL 証明書のファイル名
pt_br: O nome do arquivo do certificado SSL a ser usado
ru: Имя файла сертификата SSL для использования
zh_hans: 要使用的 SSL 证书的文件名
zh_hant: 要使用的 SSL 憑證檔案名稱

# postgres.connectionOptions.ssl.crl.displayName
source: SSL CRL filename
de: Dateiname der SSL-Zertifikatssperrliste
ja: SSL CRL ファイル名
pt_br: Nome do arquivo SSL CRL
ru: Сборка проекта PostgreSQL
zh_hans: SSL CRL 文件名
zh_hant: SSL CRL 檔案名稱

# postgres.connectionOptions.ssl.crl.description
source: The filename of the SSL certificate revocation list to use
de: Der Dateiname der zu verwendenden SSL-Zertifikatsperrliste.
ja: 使用する SSL 証明書失効リストのファイル名
pt_br: O nome do arquivo da lista de revogação de certificados SSL a ser usada
ru: Имя файла списка отзыва сертификатов SSL для использования
zh_hans: 要使用的 SSL 证书吊销列表的文件名
zh_hant: 要使用之 SSL 憑證吊銷清單的檔案名稱

# postgres.connectionOptions.requirepeer.displayName
source: Require peer
de: Peer erforderlich
ja: Peer ノードが必要
pt_br: Exigir par
ru: Требовать одноранговый узел
zh_hans: 需要对等机
zh_hant: 需要同儕節點

# postgres.connectionOptions.requirepeer.description
source: The required username of the server process
de: Der erforderliche Benutzername des Serverprozesses.
ja: サーバー プロセスに必要なユーザー名
pt_br: O nome de usuário necessário do processo do servidor
ru: Требуемое имя пользователя серверного процесса
zh_hans: 服务器进程的必需用户名
zh_hant: 伺服器流程的必要使用者名稱

# postgres.connectionOptions.service.displayName
source: Service name
de: Dienstname
ja: サービス名
pt_br: Nome do serviço
ru: Имя службы
zh_hans: 服务名称
zh_hant: 服務名稱

# postgres.connectionOptions.service.description
source: The service name in pg_service.conf to use for connection parameters
de: Der Dienstname in pg_service.conf, der für Verbindungsparameter verwendet werden soll.
ja: 接続パラメーターに使用する pg_service.conf 内のサービス名
pt_br: O nome do serviço em pg_service.conf a ser usado para parâmetros de conexão
ru: Имя службы в pg_service.conf, которое будет использоваться для параметров соединения.
zh_hans: 用于连接参数的 pg_service.conf 中的服务名称
zh_hant: 要用於連線參數之 pg_service.conf 中的服務名稱

# postgres.resourceDeployment.displayName
source: Azure Database for PostgreSQL
pt_br: Banco de Dados do Azure para PostgreSQL
ru: База данных Azure для PostgreSQL
zh_hant: 適用於 PostgreSQL 的 Azure 資料庫

# postgres.resourceDeployment.description
source: Create an Azure Database for PostgreSQL flexible server - a fully managed PostgreSQL database as a service on Azure.
de: Erstellen Sie einen flexiblen Azure Database for PostgreSQL-Server – eine vollständig verwaltete PostgreSQL-Datenbank als Dienst in Azure.
ja: Azure Database for PostgreSQL フレキシブル サーバー - Azure 上のサービスとしてのフル マネージド PostgreSQL データベース を作成します。
pt_br: Crie um servidor flexível do Banco de Dados do Azure para PostgreSQL – um banco de dados PostgreSQL totalmente gerenciado como serviço no Azure.
ru: Создайте гибкий сервер базы данных Azure для PostgreSQL — полностью управляемую базу данных PostgreSQL как службу в Azure.
zh_hans: 创建 Azure Database for PostgreSQL 灵活服务器 - Azure 上完全托管的 PostgreSQL 数据库即服务。
zh_hant: 建立適用於 PostgreSQL 的 Azure 資料庫彈性伺服器 - 完全受控的 PostgreSQL 資料庫，作為 Azure 上的服務。
