Repository: microsoft/azuredatastudio-postgresql
Catalog: src/l10n/transXlf/l10n.*.xlf
Languages: de, ja, pt_br, ru, zh_hans, zh_hant

# postgres.resourceDeployment.okButtonText
source: Create in Azure portal
de: Im Azure-Portal erstellen
ja: Azure portal で作成
pt_br: Criar no portal do Azure
ru: Создать на портале Azure
zh_hans: 在 Azure 门户中创建
zh_hant: 在 Azure 入口網站中建立

# postgres.resourceDeployment.agreements.template
source: I accept the {0} and {1}.
de: Ich akzeptiere die {0} und {1}.
ja: {0} と {1} に同意します。
pt_br: Eu aceito o {0} e {1}.
ru: Я принимаю {0} и {1}.
zh_hans: 我接受 {0} 和 {1}。
zh_hant: 我接受{0}和{1}。

# postgres.resourceDeployment.helpTexts.template
source: Azure Database for PostgreSQL Flexible Server is a relational database service powered by the PostgreSQL community edition. It's a fully managed database as a service offering that can handle mission-critical workloads with predictable performance and dynamic scalability. Additionally, it is designed for more granular control and flexibility over database management functions and configuration settings. {0}
de: Der flexible Azure Database for PostgreSQL-Server ist ein relationaler Datenbankdienst, der von der PostgreSQL Community Edition unterstützt wird. Es handelt sich um ein vollständig verwaltetes Database-as-a-Service-Angebot, das unternehmenskritische Workloads mit vorhersagbarer Leistung und dynamischer Skalierbarkeit verarbeiten kann. Darüber hinaus ermöglicht er eine genauere Kontrolle und Flexibilität der Datenbankverwaltungsfunktionen und Konfigurationseinstellungen. {0}
ja: Azure Database for PostgreSQL フレキシブル サーバーは、PostgreSQL コミュニティ エディションを利用したリレーショナル データベース サービスです。これは、予測可能なパフォーマンスと動的スケーラビリティを備えたミッション クリティカルなワークロードを処理できる、フル マネージドのサービスとしてのデータベースです。さらに、データベース管理機能と構成設定をより細かく制御し、柔軟性を高めるために設計されています。 {0}
pt_br: O Servidor Flexível do Banco de Dados do Azure para PostgreSQL é um serviço de banco de dados relacional desenvolvido pela edição da comunidade PostgreSQL. É uma oferta de banco de dados como serviço totalmente gerenciada que pode lidar com cargas de trabalho de missão crítica com desempenho previsível e escalabilidade dinâmica. Além disso, ele foi projetado para oferecer controle e flexibilidade mais granulares sobre funções de gerenciamento de banco de dados e definições de configuração. {0}
ru: База данных Azure для гибкого сервера PostgreSQL — это служба реляционной базы данных, работающая на базе версии сообщества PostgreSQL. Это предложение полностью управляемой базы данных как услуги, которая может обрабатывать критически важные рабочие нагрузки с прогнозируемой производительностью и динамической масштабируемостью. Кроме того, она предназначена для более детального контроля и обеспечения гибкости функций управления базы данных и параметров конфигурации. {0}
zh_hans: Azure Database for PostgreSQL 灵活服务器是由 PostgreSQL 社区版提供支持的关系数据库服务。它是一种完全托管的数据库即服务产品，可通过可预测的性能和动态可伸缩性处理任务关键型工作负载。此外，它旨在让你能够更精细地控制且更灵活地使用数据库管理功能和配置设置。{0}
zh_hant: 適用於 PostgreSQL 的 Azure 資料庫彈性伺服器是由 PostgreSQL 社群版本所提供的關聯式資料庫服務。這是完全受控的資料庫，作為服務供應項目，可處理具有可預測效能和動態可擴縮性的任務關鍵工作負載。此外，它的設計目的是針對資料庫管理功能和組態設定進行更細微的控制與彈性。{0}

source: Microsoft Azure terms of use
de: Microsoft Azure-Nutzungsbedingungen
ja: Microsoft Azure 利用規約
pt_br: Termos de uso do Microsoft Azure
ru: Условия использования Microsoft Azure
zh_hans: Microsoft Azure 使用条款
zh_hant: Microsoft Azure 使用規定

source: Microsoft Privacy Statement
de: Microsoft-Datenschutzbestimmungen
ja: Microsoft プライバシー ステートメント
pt_br: Política de Privacidade da Microsoft
ru: Заявление о конфиденциальности Майкрософт
zh_hans: Microsoft 隐私声明
zh_hant: Microsoft 隱私權聲明

source: Learn More.
de: Weitere Informationen.
ja: 詳細情報。
pt_br: Saiba Mais.
ru: Дополнительные сведения.
zh_hans: 了解详细信息。
zh_hant: 深入了解。

# postgres.command.buildAll
source: Build all PostgreSQL projects
de: Alle PostgreSQL-Projekte erstellen
ja: すべての PostgreSQL プロジェクトをビルドする
pt_br: Compilar todos os projetos PostgreSQL
ru: Сборка всех проектов PostgreSQL
zh_hans: 生成所有 PostgreSQL 项目
zh_hant: 建置所有 PostgreSQL 專案

# postgres.command.buildCurrent
source: Build PostgreSQL project
de: PostgreSQL-Projekt erstellen
ja: PostgreSQL プロジェクトのビルド
pt_br: Compilar projeto PostgreSQL
ru: Сборка проекта PostgreSQL
zh_hans: 生成 PostgreSQL 项目
zh_hant: 建置 PostgreSQL 專案

# postgres.command.newProject
source: New PostgreSQL Project
de: Neues PostgreSQL-Projekt
ja: 新しい PostgreSQL プロジェクト
pt_br: Novo Projeto PostgreSQL
ru: Новый проект PostgreSQL
zh_hans: 新建 PostgreSQL 项目
zh_hant: 新增 PostgreSQL 專案

# postgres.command.deploy
source: Deploy
de: Bereitstellen
ja: デプロイ
pt_br: Implantar
ru: Развернуть
zh_hans: 部署
zh_hant: 部署

# extension.buildProgressTitle
source: Building projects
de: Projekte werden erstellt
ja: プロジェクトのビルド
pt_br: Criando projetos
ru: Сборка проектов
zh_hans: 正在生成项目
zh_hant: 正在建置專案

# extension.deploymentStartedMessage
source: Deployment started {0}.
ja: デプロイが開始されました {0}。
pt_br: A implementação foi iniciada {0}.
ru: Развертывание запущено {0}.
zh_hans: 部署已启动 {0}。
zh_hant: 部署已開始 {0}。

# extension.FailedDeploy
source: Deployment failed with error: {0}
de: Fehler bei der Bereitstellung: {0}
ja: デプロイは次のエラーで失敗しました: {0}
pt_br: A implantação falhou com erro: {0}
ru: Развертывание завершилось с ошибкой: {0}
zh_hans: 部署失败，出现错误: {0}
zh_hant: 部署失敗，錯誤為: {0}

# extension.GetOutputPathFailed
source: Unable to find output file path to deploy.
de: Der bereitzustellende Ausgabedateipfad wurde nicht gefunden.
ja: デプロイする出力ファイル パスが見つかりません。
pt_br: Não foi possível localizar o caminho do arquivo de saída para implantação.
ru: Не удалось найти путь к выходному файлу для развертывания.
zh_hans: 找不到要部署的输出文件路径。
zh_hant: 找不到要部署的輸出檔案路徑。

# extension.deployBeginFailed
source: Deploy cannot begin until your project builds successfully.
de: Die Bereitstellung kann erst beginnen, wenn das Projekt erfolgreich erstellt wurde.
ja: プロジェクトが正常にビルドされるまでデプロイを開始できません。
pt_br: A implantação não pode começar até que seu projeto seja compilado com êxito.
ru: Развертывание не может начаться, пока ваш проект не будет успешно собран.
zh_hans: 在成功生成项目之前，无法开始部署。
zh_hant: 必須等到專案建置成功後，才能開始部署。

# extension.projectNamePrompt
source: Project Name
de: Projektname
ja: プロジェクト名
pt_br: Nome do Projeto
ru: Имя проекта
zh_hans: 项目名称
zh_hant: 專案名稱

# extension.projectNameEmptyErrorMessage
source: Project names cannot be empty
de: Projektnamen dürfen nicht leer sein.
ja: プロジェクト名を空にすることはできません
pt_br: Os nomes dos projetos não podem ficar vazios
ru: Названия проектов не могут быть пустыми
zh_hans: 项目名称不能为空
zh_hant: 專案名稱不可為空白

# extension.projectNameSpecialCharsErrorMessage
source: Project names cannot contain any of the following characters: /?:&\*"<>|#%;
de: Projektnamen dürfen keines der folgenden Zeichen enthalten: /?:&\*"<>|#%;
ja: プロジェクト名に次の文字を含めることはできません: /?:&\*"<>|#%;
pt_br: Os nomes dos projetos não podem conter nenhum dos seguintes caracteres: /?:&\*"<>|#%;
ru: Имена проектов не могут содержать следующие символы: /?:&\*"<>|#%;
zh_hans: 项目名称不能包含以下任何字符: /?:&\*"<>|#%;
zh_hant: 專案名稱不能包含下列任何字元: /?:&\*"<>|#%;

# extension.projectNameInvalidErrorMessage
source: Project names cannot be '.' or '..'
de: Projektnamen dürfen nicht "." oder ".." sein.
ja: プロジェクト名を '.' または '..' にすることはできません
pt_br: Os nomes dos projetos não podem ser '.' ou '..'
ru: Проекты не могут называться "." или ".."
zh_hans: 项目名称不能为 "." 或 ".."
zh_hant: 專案名稱不能是 '.' 或 '..'

# extension.projectNameInvalidCharErrorMessage
source: Project names cannot contain '..'
de: Projektnamen dürfen nicht ".." enthalten.
ja: プロジェクト名に '..'' を含めることはできません
pt_br: Os nomes dos projetos não podem conter '..'
ru: Названия проектов не могут содержать символы ".."
zh_hans: 项目名称不能包含 ".."
zh_hant: 專案名稱不能包含 '..'

# extension.projectNameAlreadyExists
source: Project with same name already exists
de: Ein Projekt mit dem gleichen Namen ist bereits vorhanden.
ja: 同じ名前のプロジェクトが既に存在します
pt_br: Projeto com mesmo nome já existe
ru: Проект с таким названием уже существует
zh_hans: 同名项目已存在
zh_hant: 已存在相同名稱的專案

# extension.unsupportedPostgreSQLSdkMessage
source: There are some projects that use unsupported version of PostgreSQL SDK.
de: Es gibt einige Projekte, die eine nicht unterstützte Version des PostgreSQL SDK verwenden.
ja: サポートされていないバージョンの PostgreSQL SDK を使用するプロジェクトがいくつかあります。
pt_br: Há alguns projetos que usam versões sem suporte do SDK do PostgreSQL.
ru: Некоторые проекты используют неподдерживаемую версию PostgreSQL SDK.
zh_hans: 有些项目使用了不受支持的 PostgreSQL SDK 版本。
zh_hant: 有些專案使用不支援的 PostgreSQL SDK 版本。

# extension.updateProjectButtonText
source: Update Projects
de: Projekte aktualisieren
ja: プロジェクトの更新
pt_br: Atualizar Projetos
ru: Обновление проектов
zh_hans: 更新项目
zh_hant: 更新專案

# extension.updatingSdkMessage
source: Updating PostgreSQL SDK version for file {0}.
de: Die PostgreSQL SDK-Version für Datei {0} wird aktualisiert.
ja: ファイル {0}の PostgreSQL SDK バージョンを更新しています。
pt_br: Atualizando a versão do SDK do PostgreSQL para o arquivo {0}.
ru: Обновление версии PostgreSQL SDK для файла {0}.
zh_hans: 正在更新文件 {0} 的 PostgreSQL SDK 版本。
zh_hant: 正在更新檔案 {0} 的 PostgreSQL SDK 版本。

# extension.updatingSdkErrorMessage
source: Error updating SDK version for file {0}.
de: Fehler beim Aktualisieren der SDK-Version für Datei {0}.
ja: ファイル {0}の SDK バージョンの更新中にエラーが発生しました。
pt_br: Erro ao atualizar a versão do SDK para o arquivo {0}.
ru: Ошибка обновления версии SDK для файла {0}.
zh_hans: 更新文件 {0} 的 SDK 版本时出错。
zh_hant: 更新檔案 {0} 的 SDK 版本時發生錯誤。

# extension.sdkUpdateCompleteMessage
source: Project file {0} has been updated.
de: Die Projektdatei {0} wurde aktualisiert.
ja: プロジェクト ファイル {0} が更新されました。
pt_br: O arquivo de projeto {0} foi atualizado.
ru: Файл проекта {0} обновлен.
zh_hans: 项目文件 {0} 已更新。
zh_hant: 專案檔案 {0} 已更新。

# extension.installDotNetCoreButtonText
source: Install .NET Core SDK...
de: .NET Core SDK installieren...
ja: .NET Core SDK をインストール...
pt_br: Instalar SDK do .NET Core...
ru: Установка .NET Core SDK...
zh_hans: 安装 .NET Core SDK...
zh_hant: 安裝 .NET Core SDK...

# extension.dotNetCoreNotFoundMessage
source: The .NET Core SDK was not found.
de: Das .NET Core SDK wurde nicht gefunden.
ja: .NET Core SDK が見つかりませんでした。
pt_br: O SDK do .NET Core não foi encontrado.
ru: Пакет SDK для .NET Core не найден.
zh_hans: 找不到 .NET Core SDK。
zh_hant: 找不到 .NET Core SDK。

# extension.dotNetCoreMessage
source: The PostgreSQL extension requires .NET Core SDK version {0} or later, but {1} was found.
de: Die PostgreSQL-Erweiterung erfordert .NET Core SDK Version {0} oder höher, es wurde jedoch {1} gefunden.
ja: PostgreSQL 拡張機能には.NET Core SDKバージョン {0} 以降が必要ですが、 {1} が見つかりました。
pt_br: A extensão PostgreSQL requer a versão {0} do SDK do .NET Core ou posterior, mas {1} foi encontrado.
ru: Для расширения PostgreSQL требуется версия SDK {0} .NET Core или более поздней версии, но найдена {1}.
zh_hans: PostgreSQL 扩展需要 .NET Core SDK {0} 或更高版本，但找到的是 {1} 版本。
zh_hant: PostgreSQL 延伸模組需要 .NET Core SDK版本 {0} 或更新版本，但找到 {1}。

# unsupportedPlatformMsg
source: Unsupported platform
de: Nicht unterstützte Plattform
ja: サポートされていないプラットフォーム
pt_br: Plataforma sem suporte
ru: Неподдерживаемая платформа
zh_hans: 不受支持的平台
zh_hant: 不支援的平台

# serviceStartedStatusMsg
source: {0} service started
de: {0} wurde gestartet.
ja: {0} サービスが開始しました
pt_br: {0} serviço iniciado
ru: Служба {0} запущена
zh_hans: 已启动 {0} 服务
zh_hant: {0} 服務已啟動

# startingServiceStatusMsg
source: Starting {0} service
de: {0}-Dienst wird gestartet
ja: {0} サービスを開始しています
pt_br: Iniciando {0} serviço
ru: Выполняется запуск службы {0}
zh_hans: 正在启动 {0} 服务
zh_hant: 正在啟動 {0} 服務

# failedToStartServiceErrorMsg
source: Failed to start {0} tools service
de: Fehler beim Starten von {0} Toolsdiensts.
ja: {0} ツール サービスを開始できませんでした
pt_br: Falha ao iniciar {0} serviço de ferramentas
ru: Не удалось запустить службу инструментов {0}
zh_hans: 无法启动 {0} 工具服务
zh_hant: 無法啟動 {0} 工具服務

# failedToVerifyProjectSDKErrorMsg
source: Failed to verify project SDK, error: {0}
de: Fehler beim Überprüfen des Projekt-SDK. Fehler: {0}
ja: プロジェクト SDK を確認できませんでした。エラー: {0}
pt_br: Falha ao verificar o SDK do projeto, erro: {0}
ru: Не удалось проверить SDK проекта, ошибка: {0}
zh_hans: 未能验证项目 SDK，错误: {0}
zh_hant: 無法驗證專案 SDK，錯誤: {0}

# extension.DeployCompleted
source: Deployment completed successfully.
de: Die Bereitstellung wurde erfolgreich abgeschlossen.
ja: デプロイが正常に完了しました。
pt_br: A implantação foi concluída com êxito.
ru: Развертывание выполнено успешно.
zh_hans: 已成功完成部署。
zh_hant: 已成功地完成部署。

# extension.deployErrorMessage
source: Error: {0}
de: Fehler: {0}
ja: エラー: {0}
pt_br: Erro: {0}
ru: Ошибка: {0}
zh_hans: 错误: {0}
zh_hant: 錯誤: {0}

# extension.runQueryBatchStartMessage
source: Started executing query at {0}
ja: {0}でクエリの実行を開始しました
pt_br: Iniciada a execução da consulta no {0}
ru: Начало выполнения запроса: {0}
zh_hans: 已开始在 {0} 执行查询
zh_hant: 已開始執行以下查詢: {0}

# installingServiceChannelMsg
source: Installing {0} to {1}
de: "{0}" wird in "{1}" installiert.
ja: {0} を {1} にインストールしています
pt_br: Instalando {0} para {1}
ru: Установка {0} в {1}
zh_hans: 正在将 {0} 安装到 {1}
zh_hant: 正在將 {0} 安裝到 {1}

# installingServiceStatusMsg
source: Installing {0}
de: {0} wird installiert
ja: {0} をインストールしています
pt_br: Instalando {0}
ru: Установка {0}
zh_hans: 正在安装 {0}
zh_hant: 正在安裝 {0}

# installedServiceChannelMsg
source: Installed {0}
de: {0} wurde installiert
ja: {0} がインストールされました
pt_br: Instalado {0}
ru: Установлено: {0}
zh_hans: 已安装 {0}
zh_hant: 已安裝 {0}

# downloadingServiceChannelMsg
source: Downloading {0}
de: {0} wird heruntergeladen
ja: {0} をダウンロードしています
pt_br: Baixando {0}
ru: Скачивается {0}
zh_hans: 正在下载 {0}
zh_hant: 正在下載 {0}

# downloadingServiceStatusMsg
source: Downloading {0}
de: {0} wird heruntergeladen
ja: {0} をダウンロードしています
pt_br: Baixando {0}
ru: Скачивается {0}
zh_hans: 正在下载 {0}
zh_hant: 正在下載 {0}

# downloadServiceDoneChannelMsg
source: Done!
de: Fertig!
ja: 完了しました!
pt_br: Concluído!
ru: Готово.
zh_hans: 完成!
zh_hant: 完成!

# extension.existingBuildInProgressMessage
source: There is a build already running, please cancel the build before starting a new one
de: Es wird bereits ein Build ausgeführt. Brechen Sie den Build ab, bevor Sie einen neuen erstellen.
ja: 既にビルドが実行されています。新しいビルドを開始する前にビルドをキャンセルしてください
pt_br: Já existe uma compilação em execução. Cancele a compilação antes de iniciar uma nova
ru: Сборка уже запущена. Отмените сборку, прежде чем начинать новую.
zh_hans: 有一个生成已在运行，请先取消此生成，然后再开始新的生成
zh_hant: 已有組建正在執行，請先取消組建，再開始新的組建

# extension.buildSummaryMessage
source: ======== Build: {0} succeeses or up-to-date, {1} failed, {2} skipped ========
de: Erstellen: {0} erfolgreich oder aktuell, {1} fehlgeschlagen, {2} übersprungen
ja: ======== ビルド: {0} 成功または最新の状態、{1} 失敗、{2} スキップ ========
pt_br: ======== Build: {0} bem-sucedido ou atualizado, {1} falhou, {2} ignorado ========
ru: ======== Сборка: {0} успешно установлена или обновлена, {1} завершена сбоем, {2} пропущена ========
zh_hans: ======== 生成: {0} 成功或最新，{1} 失败，{2} 已跳过 ========
zh_hant: ======= 組建: {0} 成功或是最新狀態，{1} 失敗，{2} 略過 =======

# extension.projectUpdateFailedMessage
source: Failed to build project {0} with SDK Version {1}. Installed PostgreSQL extension only supports SDK version between {2} and {3}.
ja: SDK バージョン {1} でプロジェクト {0} をビルドできませんでした。 インストールされている PostgreSQL 拡張機能では、 {2} と {3} の間の SDK バージョンのみがサポートされます。
pt_br: Falha ao criar o projeto {0} com a Versão do SDK {1} . A extensão PostgreSQL instalada só dá suporte à versão SDK entre {2} e {3}.
ru: Не удалось создать проект {0} с версией SDK {1}. Установленное расширение PostgreSQL поддерживает только версии SDK между {2} и {3}.
zh_hans: 未能使用 SDK 版本 {1} 生成项目 {0}。 安装的 PostgreSQL 扩展仅支持介于 {2} 到 {3} 之间的 SDK 版本。
zh_hant: 無法使用 SDK 版本 {0} 建置專案 {1}。 已安裝的 PostgreSQL 延伸模組只支援 {2} 與 {3} 之間的 SDK 版本。

# extension.buildCancelMessage
source: Build has been cancelled
de: Die Erstellung wurde abgebrochen.
ja: ビルドが取り消されました
pt_br: A compilação foi cancelada
ru: Сборка отменена
zh_hans: 已取消生成
zh_hant: 已取消建置

# downloadingServiceSizeChannelMsg
source: ({0} KB)
ru: ({0} КБ)

# extension.deploymentStartedMessage
source: Deployment started {0}.
de: Die Bereitstellung wurde gestartet {0}.

# extension.runQueryBatchStartMessage
source: Started executing query at {0}
de: Ausführung der Abfrage gestartet um {0}

# extension.projectUpdateFailedMessage
source: Failed to build project {0} with SDK Version {1}. Installed PostgreSQL extension only supports SDK version between {2} and {3}.
de: Fehler beim Erstellen des Projekts "{0}" mit SDK-Version {1}. Die installierte PostgreSQL-Erweiterung unterstützt nur die SDK-Version zwischen {2} und {3}.
